app/controllers/post_controller.rb

  def newpost

    result = Hash.new()

    begin
      Post.create(:userid=> params[:userid], :title=> params[:title], :postext=> params[:postexto] )
---
INSERT INTO "posts" ("created_at", "postext", "title", "updated_at", "userid") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Tue, 20 Nov 2012 04:16:49 UTC +00:00], ["postext", "la vida es dura"], ["title", "la vida es dura"], ["updated_at", Tue, 20 Nov 2012 04:16:49 UTC +00:00], ["userid", 1]]